/*
Допустим, вам надо разработать систему учета рабочего времени.
Система должна хранить данные о времени прихода работника в офис и о времени выхода из офиса.
Система должна уметь посчитать
- суммарное отработанное работником время за текущий месяц
- суммарное отработанное работником время за заданный месяц
- вывести данные о переработках по дням за заданные интервал дат
- вывести данные об опозданиях по дням за заданные интервал дат

 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}